"""


ژنرال سهیل می خواهد نیروهای خود که درون قلعه بالا نوک قله کوه به قلعه دیگر که نوک قله کوه دیگر است ببرد، برای صرفه جویی در زمان و انرژی سربازان خود او می خواهد کوتاه ترین مسیر ممکن بین این دو قلعه را بیابد.

 بر روی نقشه کوه ها از بالا به صورت یک مربع هستن که قلعه ها در مرکز این مربع ها قرار دارند.

ورودی

 خط اول ورودی شامل پنج عدد صحیح x1 و y1 و x2 و y2 و h ( ﻿−105≤x1,x2,y1,y2≤105−105≤x1,x2,y1,y2≤105﻿ ,﻿(x1,y1)=!(x2,y2)(x1,y1)=!(x2,y2)﻿  )  است که در آن‌ها (x1, y1) و (x2, y2) یک ضلع از قاعده‌ی اولین کوه را تعریف می‌کنند، به‌طوری که بدنه‌ی کوه در سمت چپ بردار جهت‌دار از (x1, y1) به (x2, y2) قرار دارد. عدد h ﻿(1≤h≤105)(1≤h≤105)﻿ نیز ارتفاع هرم است.

 خط دوم ورودی اطلاعات هرم دوم را به همین فرمت توصیف می‌کند. اشتراک قاعده‌های دو هرم صفر است (یعنی روی هم نمی‌افتند).

نمونه ورودی
 0 0 10 0 4
 9 18 34 26 42

خروجی

 حداقل فاصله‌ای که کارل باید از نوک یک هرم به نوک هرم دیگر طی کند را چاپ کنید. جواب شما باید دارای خطای مطلق یا نسبی حداکثر ۱۰⁻⁶ باشد.

نمونه خروجی
 60.866649532

"""







